require("dependencies").add { source = "folke/snacks.nvim" }

require("snacks").setup {
  statuscolumn = {
    enabled = true,
  },
  dashboard = {
    preset = {
      header = [[
███╗   ███╗██╗   ██╗██╗  ████████╗██╗██╗   ██╗██╗███╗   ███╗
████╗ ████║██║   ██║██║  ╚══██╔══╝██║██║   ██║██║████╗ ████║
██╔████╔██║██║   ██║██║     ██║   ██║██║   ██║██║██╔████╔██║
██║╚██╔╝██║██║   ██║██║     ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║
██║ ╚═╝ ██║╚██████╔╝███████╗██║   ██║ ╚████╔╝ ██║██║ ╚═╝ ██║
╚═╝     ╚═╝ ╚═════╝ ╚══════╝╚═╝   ╚═╝  ╚═══╝  ╚═╝╚═╝     ╚═╝
    ]],
    },
    sections = {
      { section = "header" },
      {
        section = "keys",
        gap = 1,
        indent = 2,
        padding = 1,
      },
      {
        icon = " ",
        title = "Recent Files",
        section = "recent_files",
        indent = 2,
        padding = 1,
      },
      {
        icon = " ",
        title = "Projects",
        section = "projects",
        indent = 2,
        padding = 1,
      },
    },
  },
}
